<!-- dflook/terraform-github-actions {"workspace":"default","backend":"b57a951d59a45ca6ef6e9a522148dfffa314b67f9a118e5d951209dac2f26ed8","backend_type":"local","plan_job_ref":"Job terraform execution #5 at https://github.com/komal0094/terraform_code2/actions/runs/3104101533","plan_hash":"2a32274242cfa06ec0cafb4f5b3398813af207242c2982b710c5d980d01edf13","plan_text_format":"text"} -->
Terraform plan in __.__
<details>
<summary>Plan: 10 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.nw.aws_internet_gateway.my-igw will be created
  + resource "aws_internet_gateway" "my-igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "default-igw001"
          + "env"  = "default"
        }
      + tags_all = {
          + "Name" = "default-igw001"
          + "env"  = "default"
        }
      + vpc_id   = (known after apply)
    }

  # module.nw.aws_route.igw001 will be created
  + resource "aws_route" "igw001" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.nw.aws_route_table.pub-rt will be created
  + resource "aws_route_table" "pub-rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "default-pub-route001"
          + "env"  = "default"
        }
      + tags_all         = {
          + "Name" = "default-pub-route001"
          + "env"  = "default"
        }
      + vpc_id           = (known after apply)
    }

  # module.nw.aws_route_table_association.pub-ass["pub-sub-1"] will be created
  + resource "aws_route_table_association" "pub-ass" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.nw.aws_route_table_association.pub-ass["pub-sub-2"] will be created
  + resource "aws_route_table_association" "pub-ass" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.nw.aws_subnet.pri-subnet["pri-sub-1"] will be created
  + resource "aws_subnet" "pri-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.128.0/18"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "default-pri-snets"
        }
      + tags_all                                       = {
          + "Name" = "default-pri-snets"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.nw.aws_subnet.pri-subnet["pri-sub-2"] will be created
  + resource "aws_subnet" "pri-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.192.0/18"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "default-pri-snets"
        }
      + tags_all                                       = {
          + "Name" = "default-pri-snets"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.nw.aws_subnet.pub-subnet["pub-sub-1"] will be created
  + resource "aws_subnet" "pub-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/18"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "default-pub-snets"
        }
      + tags_all                                       = {
          + "Name" = "default-pub-snets"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.nw.aws_subnet.pub-subnet["pub-sub-2"] will be created
  + resource "aws_subnet" "pub-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.64.0/18"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "default-pub-snets"
        }
      + tags_all                                       = {
          + "Name" = "default-pub-snets"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.nw.aws_vpc.my-vpc001 will be created
  + resource "aws_vpc" "my-vpc001" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "default-dev-vpc"
          + "env"  = "default"
        }
      + tags_all                             = {
          + "Name" = "default-dev-vpc"
          + "env"  = "default"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [terraform execution #5](https://github.com/komal0094/terraform_code2/actions/runs/3104101533)